app/Controllers/Dashboard.php

SELECT *
FROM `users`
---
    public function index()
    {
        $users  =   $this->userModel->asObject()->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
UPDATE `users` SET `firstname` = 'Miguelasw', `lastname` = 'Santistebana', `email` = 'miguel@gmail.com', `updated_at` = '2024-01-22 20:59:29'
WHERE `users`.`id` IN ('2')
---
    public function edit( $id )
    {
        helper( [ 'form' ] );

        $user =   $this->userModel->asObject()->find( $id );

        $data   =   [
            'title'     =>  'Edit User',
            'user'    =>  $user
        ];

        if ( $this->request->getMethod() == 'post' ){
            $userData   =   [
                'firstname'     =>  $this->request->getVar( 'firstnameFrm' ),
                'lastname'      =>  $this->request->getVar( 'lastnameFrm' ),
                'email'         =>  $this->request->getVar( 'emailFrm' )
            ];

            $this->userModel->update( $id, $userData );