app/Controllers/UserController.php

INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`) VALUES ('George', 'Washington', 'george@gmail.com', '1234')
---
                        'password'      =>  $this->request->getVar( 'pwdFrm' ),
                    ];

                    $this->userModel->save( $newData );