app/Controllers/UserController.php

                $data[ 'validation' ] = $this->validator;
            }else
                {
                    $user   =   $this->userModel->where( 'email', $this->request->getVar( 'emailFrm' ) )
                                    ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'miguel@gmail.com'
 LIMIT 1